
<!DOCTYPE HTML>
<html lang="zh-hans" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>1.1 进程内存概念 · ebook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        <meta name="author" content="zhangkaiyuan">
        
        
    
    <link rel="stylesheet" href="../../../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../../../gitbook/gitbook-plugin-search-plus/search.css">
                
            
                
                <link rel="stylesheet" href="../../../gitbook/gitbook-plugin-back-to-top-button/plugin.css">
                
            
                
                <link rel="stylesheet" href="../../../gitbook/gitbook-plugin-expandable-chapters-small/expandable-chapters-small.css">
                
            
                
                <link rel="stylesheet" href="../../../gitbook/gitbook-plugin-code/plugin.css">
                
            
                
                <link rel="stylesheet" href="../../../gitbook/gitbook-plugin-splitter/splitter.css">
                
            
                
                <link rel="stylesheet" href="../../../gitbook/gitbook-plugin-chapter-fold/chapter-fold.css">
                
            
                
                <link rel="stylesheet" href="../../../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../../../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../../../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="GNUAllocator.html" />
    
    
    <link rel="prev" href="memoryManagement.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="输入并搜索" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../../../">
            
                <a href="../../../">
            
                    
                    Introduction
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="../../computer.html">
            
                <a href="../../computer.html">
            
                    
                    计算机
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.2.1" data-path="../glibc.html">
            
                <a href="../glibc.html">
            
                    
                    glibc
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.2.1.1" data-path="memoryManagement.html">
            
                <a href="memoryManagement.html">
            
                    
                    1 虚拟地址分配和分页
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter active" data-level="1.2.1.1.1" data-path="ProcessMemoryConcepts.html">
            
                <a href="ProcessMemoryConcepts.html">
            
                    
                    1.1 进程内存概念
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.1.1.2" data-path="GNUAllocator.html">
            
                <a href="GNUAllocator.html">
            
                    
                    1.2 GNU 分配器
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.1.1.3" data-path="pageTable.html">
            
                <a href="pageTable.html">
            
                    
                    1.3 页表
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.1.1.4" data-path="gdbDebug.html">
            
                <a href="gdbDebug.html">
            
                    
                    1.4 gdb调试
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.2.2" data-path="../../linux/linux.html">
            
                <a href="../../linux/linux.html">
            
                    
                    linux
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.2.2.1" data-path="../../linux/elfFile.html">
            
                <a href="../../linux/elfFile.html">
            
                    
                    1 elf文件详解
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="../../../literature/literature.html">
            
                <a href="../../../literature/literature.html">
            
                    
                    文学
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.3.1" data-path="../../../literature/poetry/poetry.html">
            
                <a href="../../../literature/poetry/poetry.html">
            
                    
                    诗词
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.3.1.1" data-path="../../../literature/poetry/sushi/sushi.html">
            
                <a href="../../../literature/poetry/sushi/sushi.html">
            
                    
                    苏轼
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.3.1.1.1" data-path="../../../literature/poetry/sushi/1.html">
            
                <a href="../../../literature/poetry/sushi/1.html">
            
                    
                    《定风波·莫听穿林打叶声》
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    

            </ul>
            
        </li>
    

            </ul>
            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            本书使用 GitBook 发布
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="../../.." >1.1 进程内存概念</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div class="search-plus" id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x8FDB;&#x7A0B;&#x5185;&#x5B58;&#x6982;&#x5FF5;"><center> &#x8FDB;&#x7A0B;&#x5185;&#x5B58;&#x6982;&#x5FF5;</center></h1>
<p>&#x8FDB;&#x7A0B;&#x53EF;&#x7528;&#x7684;&#x6700;&#x57FA;&#x672C;&#x8D44;&#x6E90;&#x4E4B;&#x4E00;&#x662F;&#x5185;&#x5B58;&#x3002;&#x7CFB;&#x7EDF;&#x7EC4;&#x7EC7;&#x5185;&#x5B58;&#x7684;&#x65B9;&#x5F0F;&#x6709;&#x5F88;&#x591A;&#x79CD;&#xFF0C;&#x4F46;&#x5728;&#x5178;&#x578B;&#x7684;&#x4E00;&#x79CD;&#x65B9;&#x5F0F;&#x4E2D;&#xFF0C;&#x6BCF;&#x4E2A;&#x8FDB;&#x7A0B;&#x90FD;&#x6709;&#x4E00;&#x4E2A;&#x7EBF;&#x6027;&#x865A;&#x62DF;&#x5730;&#x5740;&#x7A7A;&#x95F4;&#xFF0C;&#x5730;&#x5740;&#x4ECE;&#x96F6;&#x5230;&#x67D0;&#x4E2A;&#x5DE8;&#x5927;&#x7684;&#x6700;&#x5927;&#x503C;&#x3002;&#x5B83;&#x4E0D;&#x5FC5;&#x662F;&#x8FDE;&#x7EED;&#x7684;&#xFF1B;&#x5373;&#xFF0C;&#x5E76;&#x975E;&#x6240;&#x6709;&#x8FD9;&#x4E9B;&#x5730;&#x5740;&#x5B9E;&#x9645;&#x4E2D;&#x90FD;&#x53EF;&#x7528;&#x4E8E;&#x5B58;&#x50A8;&#x6570;&#x636E;&#x3002;</p>
<p>&#x865A;&#x62DF;&#x5185;&#x5B58;&#x88AB;&#x5206;&#x6210;&#x9875;&#xFF08;&#x5178;&#x578B;&#x503C;&#x4E3A; 4 KB&#xFF09;&#x3002;&#x652F;&#x6301;&#x865A;&#x62DF;&#x5185;&#x5B58;&#x7684;&#x6BCF;&#x4E00;&#x9875;&#x7684;&#x662F;&#x5B9E;&#x9645;&#x5185;&#x5B58;&#x7684;&#x4E00;&#x9875;&#xFF08;&#x79F0;&#x4E3A;&#x5E27;&#xFF09;&#x6216;&#x4E00;&#x4E9B;&#x8F85;&#x52A9;&#x5B58;&#x50A8;&#xFF0C;&#x901A;&#x5E38;&#x662F;&#x78C1;&#x76D8;&#x7A7A;&#x95F4;&#x3002;&#x78C1;&#x76D8;&#x7A7A;&#x95F4;&#x53EF;&#x80FD;&#x662F;&#x4EA4;&#x6362;&#x7A7A;&#x95F4;&#x6216;&#x53EA;&#x662F;&#x4E00;&#x4E9B;&#x666E;&#x901A;&#x7684;&#x78C1;&#x76D8;&#x6587;&#x4EF6;&#x3002;&#x5B9E;&#x9645;&#x4E0A;&#xFF0C;&#x4E00;&#x4E2A;&#x5168;&#x4E3A;&#x96F6;&#x7684;&#x9875;&#x6709;&#x65F6;&#x6839;&#x672C;&#x4E0D;&#x5B58;&#x5728;&#x4E00;&#x4E2A;&#x6807;&#x5FD7;&#x8BF4;&#x5B83;&#x662F;&#x5168;&#x96F6;&#x7684;&#x3002;</p>
<p>&#x5B9E;&#x9645;&#x5185;&#x5B58;&#x6216;&#x540E;&#x5907;&#x5B58;&#x50A8;&#x7684;&#x540C;&#x4E00;&#x5E27;&#x53EF;&#x4EE5;&#x652F;&#x6301;&#x5C5E;&#x4E8E;&#x591A;&#x4E2A;&#x8FDB;&#x7A0B;&#x7684;&#x591A;&#x4E2A;&#x865A;&#x62DF;&#x9875;&#x3002;&#x901A;&#x5E38;&#x662F;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#xFF0C;&#x4F8B;&#x5982;&#xFF0C;GNU C &#x5E93;&#x4EE3;&#x7801;&#x5360;&#x7528;&#x7684;&#x865A;&#x62DF;&#x5185;&#x5B58;&#x3002;&#x5305;&#x542B; printf &#x51FD;&#x6570;&#x7684;&#x540C;&#x4E00;&#x4E2A;&#x5B9E;&#x9645;&#x5185;&#x5B58;&#x5E27;&#x652F;&#x6301;&#x6BCF;&#x4E2A;&#x5728;&#x5176;&#x7A0B;&#x5E8F;&#x4E2D;&#x8C03;&#x7528; printf &#x7684;&#x73B0;&#x6709;&#x8FDB;&#x7A0B;&#x4E2D;&#x7684;&#x865A;&#x62DF;&#x5185;&#x5B58;&#x9875;&#x3002;</p>
<p>&#x4E3A;&#x4E86;&#x8BA9;&#x7A0B;&#x5E8F;&#x8BBF;&#x95EE;&#x865A;&#x62DF;&#x9875;&#x7684;&#x4EFB;&#x4F55;&#x90E8;&#x5206;&#xFF0C;&#x8BE5;&#x9875;&#x6B64;&#x65F6;&#x5FC5;&#x987B;&#x7531;&#x5B9E;&#x9645;&#x5E27;&#x652F;&#x6301;&#x6216;&#x8FDE;&#x63A5;&#x5230;&#x5B9E;&#x9645;&#x5E27;&#x3002;&#x4F46;&#x662F;&#x7531;&#x4E8E;&#x865A;&#x62DF;&#x5185;&#x5B58;&#x901A;&#x5E38;&#x6BD4;&#x5B9E;&#x9645;&#x5185;&#x5B58;&#x591A;&#x5F97;&#x591A;&#xFF0C;&#x56E0;&#x6B64;&#x9875;&#x5FC5;&#x987B;&#x5B9A;&#x671F;&#x5728;&#x5B9E;&#x9645;&#x5185;&#x5B58;&#x548C;&#x540E;&#x5907;&#x5B58;&#x50A8;&#x4E4B;&#x95F4;&#x6765;&#x56DE;&#x79FB;&#x52A8;&#xFF0C;&#x5F53;&#x8FDB;&#x7A0B;&#x9700;&#x8981;&#x8BBF;&#x95EE;&#x5B83;&#x4EEC;&#x65F6;&#x8FDB;&#x5165;&#x5B9E;&#x9645;&#x5185;&#x5B58;&#xFF0C;&#x7136;&#x540E;&#x5728;&#x4E0D;&#x518D;&#x9700;&#x8981;&#x65F6;&#x9000;&#x56DE;&#x5230;&#x540E;&#x5907;&#x5B58;&#x50A8;&#x3002;&#x8FD9;&#x79CD;&#x79FB;&#x52A8;&#x79F0;&#x4E3A;&#x5206;&#x9875;&#x3002;</p>
<p>&#x5F53;&#x4E00;&#x4E2A;&#x7A0B;&#x5E8F;&#x8BD5;&#x56FE;&#x8BBF;&#x95EE;&#x4E00;&#x4E2A;&#x5F53;&#x65F6;&#x6CA1;&#x6709;&#x5B9E;&#x9645;&#x5185;&#x5B58;&#x652F;&#x6301;&#x7684;&#x9875;&#x65F6;&#xFF0C;&#x8FD9;&#x88AB;&#x79F0;&#x4E3A;&#x9875;&#x9519;&#x8BEF;&#x3002;&#x5F53;&#x53D1;&#x751F;&#x9875;&#x9519;&#x8BEF;&#x65F6;&#xFF0C;&#x5185;&#x6838;&#x6682;&#x505C;&#x8FDB;&#x7A0B;&#xFF0C;&#x5C06;&#x9875;&#x653E;&#x5165;&#x5B9E;&#x9645;&#x9875;&#x5E27;&#x4E2D;&#xFF08;&#x8FD9;&#x79F0;&#x4E3A;&#x201C;&#x5206;&#x9875;&#xFF08;paging in&#xFF09;&#x201D;&#x6216;&#x201C;&#x7F3A;&#x9875;&#x4E2D;&#x65AD;&#xFF08;faulting in&#xFF09;&#x201D;&#xFF09;&#xFF0C;&#x7136;&#x540E;&#x6062;&#x590D;&#x8FDB;&#x7A0B;&#xFF0C;&#x4EE5;&#x4FBF;&#x4ECE;&#x8FDB;&#x7A0B;&#x7684;&#x89D2;&#x5EA6;&#x6765;&#x770B;&#xFF0C;&#x9875;&#x4E00;&#x76F4;&#x5728;&#x5B9E;&#x9645;&#x5185;&#x5B58;&#x4E2D;&#x3002;&#x4E8B;&#x5B9E;&#x4E0A;&#xFF0C;&#x5BF9;&#x4E8E;&#x8FDB;&#x7A0B;&#x6765;&#x8BF4;&#xFF0C;&#x6240;&#x6709;&#x9875;&#x4F3C;&#x4E4E;&#x603B;&#x662F;&#x5728;&#x5B9E;&#x9645;&#x5185;&#x5B58;&#x4E2D;&#x3002;&#x9664;&#x4E86;&#x4E00;&#x4EF6;&#x4E8B;&#xFF1A;&#x901A;&#x5E38;&#x4E3A;&#x51E0;&#x7EB3;&#x79D2;&#x7684;&#x6307;&#x4EE4;&#x7684;&#x6267;&#x884C;&#x65F6;&#x95F4;&#x7A81;&#x7136;&#x53D8;&#x5F97;&#x975E;&#x5E38;&#x975E;&#x5E38;&#x957F;&#xFF08;&#x56E0;&#x4E3A;&#x5185;&#x6838;&#x901A;&#x5E38;&#x5FC5;&#x987B;&#x6267;&#x884C;I/O&#x624D;&#x80FD;&#x5B8C;&#x6210;&#x6362;&#x9875;&#xFF08;page-in&#xFF09;&#xFF09;&#x3002;&#x5BF9;&#x4E8E;&#x5BF9;&#x6B64;&#x654F;&#x611F;&#x7684;&#x7A0B;&#x5E8F;&#xFF0C;&#x9501;&#x5B9A;&#x9875;&#x9762;&#x4E2D;&#x63CF;&#x8FF0;&#x7684;&#x529F;&#x80FD;&#x53EF;&#x4EE5;&#x63A7;&#x5236;&#x5B83;&#x3002;</p>
<p>&#x5728;&#x6BCF;&#x4E2A;&#x865A;&#x62DF;&#x5730;&#x5740;&#x7A7A;&#x95F4;&#x5185;&#xFF0C;&#x4E00;&#x4E2A;&#x8FDB;&#x7A0B;&#x5FC5;&#x987B;&#x8DDF;&#x8E2A;&#x54EA;&#x4E9B;&#x5730;&#x5740;&#x662F;&#x4EC0;&#x4E48;&#xFF0C;&#x8BE5;&#x8FDB;&#x7A0B;&#x79F0;&#x4E3A;&#x5185;&#x5B58;&#x5206;&#x914D;&#x3002;&#x5206;&#x914D;&#x901A;&#x5E38;&#x4F1A;&#x8BA9;&#x4EBA;&#x60F3;&#x5230;&#x5206;&#x914D;&#x7A00;&#x7F3A;&#x8D44;&#x6E90;&#xFF0C;&#x4F46;&#x5728;&#x865A;&#x62DF;&#x5185;&#x5B58;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x8FD9;&#x4E0D;&#x662F;&#x4E3B;&#x8981;&#x76EE;&#x6807;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x901A;&#x5E38;&#x6BD4;&#x4EFB;&#x4F55;&#x4EBA;&#x9700;&#x8981;&#x7684;&#x8981;&#x591A;&#x5F97;&#x591A;&#x3002;&#x8FDB;&#x7A0B;&#x5185;&#x7684;&#x5185;&#x5B58;&#x5206;&#x914D;&#x4E3B;&#x8981;&#x53EA;&#x662F;&#x786E;&#x4FDD;&#x540C;&#x4E00;&#x5B57;&#x8282;&#x7684;&#x5185;&#x5B58;&#x4E0D;&#x7528;&#x4E8E;&#x5B58;&#x50A8;&#x4E24;&#x4E2A;&#x4E0D;&#x540C;&#x7684;&#x4E1C;&#x897F;&#x3002;</p>
<p>&#x8FDB;&#x7A0B;&#x4EE5;&#x4E24;&#x79CD;&#x4E3B;&#x8981;&#x65B9;&#x5F0F;&#x5206;&#x914D;&#x5185;&#x5B58;&#xFF1A;&#x901A;&#x8FC7; exec &#x548C;&#x4EE5;&#x7F16;&#x7A0B;&#x65B9;&#x5F0F;&#x3002;&#x5B9E;&#x9645;&#x4E0A;&#xFF0C;fork&#x662F;&#x7B2C;&#x4E09;&#x79CD;&#x65B9;&#x5F0F;&#xFF0C;&#x4F46;&#x4E0D;&#x662F;&#x5F88;&#x6709;&#x8DA3;&#x3002;&#x8BF7;&#x53C2;&#x9605;&#x521B;&#x5EFA;&#x8FDB;&#x7A0B;&#x3002;</p>
<p>Exec&#x662F;&#x4E3A;&#x8FDB;&#x7A0B;&#x521B;&#x5EFA;&#x865A;&#x62DF;&#x5730;&#x5740;&#x7A7A;&#x95F4;&#xFF0C;&#x5C06;&#x5176;&#x57FA;&#x672C;&#x7A0B;&#x5E8F;&#x52A0;&#x8F7D;&#x5230;&#x5176;&#x4E2D;&#x5E76;&#x6267;&#x884C;&#x7A0B;&#x5E8F;&#x7684;&#x64CD;&#x4F5C;&#x3002;&#x5B83;&#x7531;&#x201C;exec&#x201D;&#x51FD;&#x6570;&#x65CF;&#xFF08;&#x4F8B;&#x5982; execl&#xFF09;&#x5B8C;&#x6210;&#x3002;&#x8BE5;&#x64CD;&#x4F5C;&#x83B7;&#x53D6;&#x4E00;&#x4E2A;&#x7A0B;&#x5E8F;&#x6587;&#x4EF6;&#xFF08;&#x53EF;&#x6267;&#x884C;&#x6587;&#x4EF6;&#xFF09;&#xFF0C;&#x5B83;&#x5206;&#x914D;&#x7A7A;&#x95F4;&#x4EE5;&#x52A0;&#x8F7D;&#x53EF;&#x6267;&#x884C;&#x6587;&#x4EF6;&#x4E2D;&#x7684;&#x6240;&#x6709;&#x6570;&#x636E;&#xFF0C;&#x52A0;&#x8F7D;&#x5B83;&#x5E76;&#x5C06;&#x63A7;&#x5236;&#x6743;&#x8F6C;&#x79FB;&#x7ED9;&#x5B83;&#x3002;&#x8BE5;&#x6570;&#x636E;&#x6700;&#x503C;&#x5F97;&#x6CE8;&#x610F;&#x7684;&#x662F;&#x7A0B;&#x5E8F;&#x7684;&#x6307;&#x4EE4;&#xFF08;&#x6587;&#x672C;&#xFF09;&#xFF0C;&#x8FD8;&#x6709;&#x7A0B;&#x5E8F;&#x4E2D;&#x7684;&#x6587;&#x5B57;&#x548C;&#x5E38;&#x91CF;&#xFF0C;&#x751A;&#x81F3;&#x4E00;&#x4E9B;&#x53D8;&#x91CF;&#xFF1A;&#x5177;&#x6709;&#x9759;&#x6001;&#x5B58;&#x50A8;&#x7C7B;&#x7684; C &#x53D8;&#x91CF;&#xFF08;&#x8BF7;&#x53C2;&#x9605; C &#x7A0B;&#x5E8F;&#x4E2D;&#x7684;&#x5185;&#x5B58;&#x5206;&#x914D;&#xFF09;&#x3002;</p>
<p>&#x4E00;&#x65E6;&#x8BE5;&#x7A0B;&#x5E8F;&#x5F00;&#x59CB;&#x6267;&#x884C;&#xFF0C;&#x5B83;&#x5C31;&#x4F1A;&#x4F7F;&#x7528;&#x7A0B;&#x5E8F;&#x5206;&#x914D;&#x6765;&#x83B7;&#x5F97;&#x989D;&#x5916;&#x7684;&#x5185;&#x5B58;&#x3002;&#x5728;&#x5E26;&#x6709; GNU C &#x5E93;&#x7684; C &#x7A0B;&#x5E8F;&#x4E2D;&#xFF0C;&#x6709;&#x4E24;&#x79CD;&#x7A0B;&#x5E8F;&#x5206;&#x914D;&#x65B9;&#x5F0F;&#xFF1A;&#x81EA;&#x52A8;&#x5206;&#x914D;&#x548C;&#x52A8;&#x6001;&#x5206;&#x914D;&#x3002;&#x8BF7;&#x53C2;&#x9605; C &#x7A0B;&#x5E8F;&#x4E2D;&#x7684;&#x5185;&#x5B58;&#x5206;&#x914D;&#x3002;</p>
<p>&#x5185;&#x5B58;&#x6620;&#x5C04; I/O &#x662F;&#x53E6;&#x4E00;&#x79CD;&#x5F62;&#x5F0F;&#x7684;&#x52A8;&#x6001;&#x865A;&#x62DF;&#x5185;&#x5B58;&#x5206;&#x914D;&#x3002;&#x5C06;&#x5185;&#x5B58;&#x6620;&#x5C04;&#x5230;&#x6587;&#x4EF6;&#x610F;&#x5473;&#x7740;&#x58F0;&#x660E;&#x67D0;&#x4E2A;&#x8FDB;&#x7A0B;&#x5730;&#x5740;&#x8303;&#x56F4;&#x7684;&#x5185;&#x5BB9;&#x5E94;&#x4E0E;&#x6307;&#x5B9A;&#x7684;&#x5E38;&#x89C4;&#x6587;&#x4EF6;&#x7684;&#x5185;&#x5BB9;&#x76F8;&#x540C;&#x3002;&#x7CFB;&#x7EDF;&#x4F7F;&#x865A;&#x62DF;&#x5185;&#x5B58;&#x6700;&#x521D;&#x5305;&#x542B;&#x6587;&#x4EF6;&#x7684;&#x5185;&#x5BB9;&#xFF0C;&#x5982;&#x679C;&#x60A8;&#x4FEE;&#x6539;&#x5185;&#x5B58;&#xFF0C;&#x7CFB;&#x7EDF;&#x4F1A;&#x5C06;&#x76F8;&#x540C;&#x7684;&#x4FEE;&#x6539;&#x5199;&#x5165;&#x6587;&#x4EF6;&#x3002;&#x8BF7;&#x6CE8;&#x610F;&#xFF0C;&#x7531;&#x4E8E;&#x865A;&#x62DF;&#x5185;&#x5B58;&#x548C;&#x9875;&#x9519;&#x8BEF;&#x7684;&#x9B54;&#x529B;&#xFF0C;&#x5728;&#x7A0B;&#x5E8F;&#x8BBF;&#x95EE;&#x865A;&#x62DF;&#x5185;&#x5B58;&#x4E4B;&#x524D;&#xFF0C;&#x7CFB;&#x7EDF;&#x6CA1;&#x6709;&#x7406;&#x7531;&#x6267;&#x884C; I/O &#x6765;&#x8BFB;&#x53D6;&#x6587;&#x4EF6;&#x6216;&#x4E3A;&#x5176;&#x5185;&#x5BB9;&#x5206;&#x914D;&#x5B9E;&#x9645;&#x5185;&#x5B58;&#x3002;&#x8BF7;&#x53C2;&#x9605;&#x5185;&#x5B58;&#x6620;&#x5C04; I/O&#x3002;</p>
<p>&#x6B63;&#x5982;&#x5B83;&#x4EE5;&#x7F16;&#x7A0B;&#x65B9;&#x5F0F;&#x5206;&#x914D;&#x5185;&#x5B58;&#x4E00;&#x6837;&#xFF0C;&#x7A0B;&#x5E8F;&#x53EF;&#x4EE5;&#x4EE5;&#x7F16;&#x7A0B;&#x65B9;&#x5F0F;&#x89E3;&#x9664;&#x5206;&#x914D;&#xFF08;&#x91CA;&#x653E;&#xFF09;&#x5B83;&#x3002;&#x60A8;&#x65E0;&#x6CD5;&#x91CA;&#x653E; exec &#x5206;&#x914D;&#x7684;&#x5185;&#x5B58;&#x3002;&#x5F53;&#x7A0B;&#x5E8F;&#x9000;&#x51FA;&#x6216;&#x6267;&#x884C;&#x65F6;&#xFF0C;&#x4F60;&#x53EF;&#x80FD;&#x4F1A;&#x8BF4;&#x5B83;&#x7684;&#x6240;&#x6709;&#x5185;&#x5B58;&#x90FD;&#x88AB;&#x91CA;&#x653E;&#x4E86;&#xFF0C;&#x4F46;&#x662F;&#x7531;&#x4E8E;&#x5728;&#x8FD9;&#x4E24;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#x5730;&#x5740;&#x7A7A;&#x95F4;&#x90FD;&#x4E0D;&#x5B58;&#x5728;&#x4E86;&#xFF0C;&#x8FD9;&#x4E00;&#x70B9;&#x771F;&#x7684;&#x6CA1;&#x6709;&#x5B9E;&#x9645;&#x610F;&#x4E49;&#x3002;&#x8BF7;&#x53C2;&#x9605;&#x7A0B;&#x5E8F;&#x7EC8;&#x6B62;&#x3002;</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="memoryManagement.html" class="navigation navigation-prev " aria-label="Previous page: 1 虚拟地址分配和分页">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="GNUAllocator.html" class="navigation navigation-next " aria-label="Next page: 1.2 GNU 分配器">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"1.1 进程内存概念","level":"1.2.1.1.1","depth":4,"next":{"title":"1.2 GNU 分配器","level":"1.2.1.1.2","depth":4,"path":"computer/glibc/memoryManagement/GNUAllocator.md","ref":"computer/glibc/memoryManagement/GNUAllocator.md","articles":[]},"previous":{"title":"1 虚拟地址分配和分页","level":"1.2.1.1","depth":3,"path":"computer/glibc/memoryManagement/memoryManagement.md","ref":"computer/glibc/memoryManagement/memoryManagement.md","articles":[{"title":"1.1 进程内存概念","level":"1.2.1.1.1","depth":4,"path":"computer/glibc/memoryManagement/ProcessMemoryConcepts.md","ref":"computer/glibc/memoryManagement/ProcessMemoryConcepts.md","articles":[]},{"title":"1.2 GNU 分配器","level":"1.2.1.1.2","depth":4,"path":"computer/glibc/memoryManagement/GNUAllocator.md","ref":"computer/glibc/memoryManagement/GNUAllocator.md","articles":[]},{"title":"1.3 页表","level":"1.2.1.1.3","depth":4,"path":"computer/glibc/memoryManagement/pageTable.md","ref":"computer/glibc/memoryManagement/pageTable.md","articles":[]},{"title":"1.4 gdb调试","level":"1.2.1.1.4","depth":4,"path":"computer/glibc/memoryManagement/gdbDebug.md","ref":"computer/glibc/memoryManagement/gdbDebug.md","articles":[]}]},"dir":"ltr"},"config":{"plugins":["-search","search-plus","-font-settings","-livereload","-highlight","-sharing","back-to-top-button","expandable-chapters-small","code","splitter","hide-element","chapter-fold","livereload"],"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"pluginsConfig":{"chapter-fold":{},"splitter":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"code":{"copyButtons":true},"hide-element":{"elements":[".gitbook-link"]},"fontsettings":{"theme":"white","family":"sans","size":2},"back-to-top-button":{},"expandable-chapters-small":{},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false},"search-plus":{}},"theme":"default","author":"zhangkaiyuan","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"title":"ebook","language":"zh-hans","gitbook":"*","description":"ebook"},"file":{"path":"computer/glibc/memoryManagement/ProcessMemoryConcepts.md","mtime":"2023-05-24T02:00:52.582Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2023-05-26T10:12:35.615Z"},"basePath":"../../..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../../../gitbook/gitbook.js"></script>
    <script src="../../../gitbook/theme.js"></script>
    
        
        <script src="../../../gitbook/gitbook-plugin-search-plus/jquery.mark.min.js"></script>
        
    
        
        <script src="../../../gitbook/gitbook-plugin-search-plus/search.js"></script>
        
    
        
        <script src="../../../gitbook/gitbook-plugin-back-to-top-button/plugin.js"></script>
        
    
        
        <script src="../../../gitbook/gitbook-plugin-expandable-chapters-small/expandable-chapters-small.js"></script>
        
    
        
        <script src="../../../gitbook/gitbook-plugin-code/plugin.js"></script>
        
    
        
        <script src="../../../gitbook/gitbook-plugin-splitter/splitter.js"></script>
        
    
        
        <script src="../../../gitbook/gitbook-plugin-hide-element/plugin.js"></script>
        
    
        
        <script src="../../../gitbook/gitbook-plugin-chapter-fold/chapter-fold.js"></script>
        
    
        
        <script src="../../../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../../../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../../../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

